
// ** Напишите программу, которая на вход принимает значение, 
//     а на выходе показывает обратное значение. 
//     1 -> 12 -> 0.5 
//     0.25 -> 4

float N = float.Parse(Console.ReadLine());

Console.Write($"{N} ->{1 / N}");
