//  3. Напишите программу вычисления функции:
// x = f(a)

int x = int.Parse(Console.ReadLine());
int y = 2 * x * x - 4 * x + 6;
Console.WriteLine(y);